Results/Verifications/S2427/point_select/tidb-server-rv64gcv_zfh_xtheadba_xtheadcondmov_xtheadmac.sysbench.log
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 12
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 12 tps: 7756.57 qps: 7756.57 (r/w/o: 7756.57/0.00/0.00) lat (ms,95%): 3.07 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 12 tps: 7585.52 qps: 7585.52 (r/w/o: 7585.52/0.00/0.00) lat (ms,95%): 3.19 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 12 tps: 8853.76 qps: 8853.76 (r/w/o: 8853.76/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 12 tps: 8542.45 qps: 8542.45 (r/w/o: 8542.45/0.00/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 12 tps: 8603.69 qps: 8603.69 (r/w/o: 8603.69/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 12 tps: 8384.37 qps: 8384.37 (r/w/o: 8384.37/0.00/0.00) lat (ms,95%): 2.81 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 12 tps: 8630.79 qps: 8630.79 (r/w/o: 8630.79/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 12 tps: 8809.69 qps: 8809.69 (r/w/o: 8809.69/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 12 tps: 8631.60 qps: 8631.60 (r/w/o: 8631.60/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 12 tps: 8960.75 qps: 8960.75 (r/w/o: 8960.75/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 12 tps: 8958.21 qps: 8958.21 (r/w/o: 8958.21/0.00/0.00) lat (ms,95%): 2.48 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 12 tps: 8102.55 qps: 8102.55 (r/w/o: 8102.55/0.00/0.00) lat (ms,95%): 2.86 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 12 tps: 7883.63 qps: 7883.63 (r/w/o: 7883.63/0.00/0.00) lat (ms,95%): 2.97 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 12 tps: 7575.14 qps: 7575.14 (r/w/o: 7575.14/0.00/0.00) lat (ms,95%): 3.19 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 12 tps: 8644.54 qps: 8644.54 (r/w/o: 8644.54/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 12 tps: 8724.77 qps: 8724.77 (r/w/o: 8724.77/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 12 tps: 9038.93 qps: 9038.93 (r/w/o: 9038.93/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 12 tps: 8907.06 qps: 8907.06 (r/w/o: 8907.06/0.00/0.00) lat (ms,95%): 2.48 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 12 tps: 9176.43 qps: 9176.43 (r/w/o: 9176.43/0.00/0.00) lat (ms,95%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 12 tps: 8875.52 qps: 8875.52 (r/w/o: 8875.52/0.00/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 12 tps: 8892.22 qps: 8892.22 (r/w/o: 8892.22/0.00/0.00) lat (ms,95%): 2.48 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 12 tps: 9045.00 qps: 9045.00 (r/w/o: 9045.00/0.00/0.00) lat (ms,95%): 2.48 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 12 tps: 9046.18 qps: 9046.18 (r/w/o: 9046.18/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 12 tps: 8775.35 qps: 8775.35 (r/w/o: 8775.35/0.00/0.00) lat (ms,95%): 2.61 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 12 tps: 8303.99 qps: 8303.99 (r/w/o: 8303.99/0.00/0.00) lat (ms,95%): 2.76 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 12 tps: 8087.57 qps: 8087.57 (r/w/o: 8087.57/0.00/0.00) lat (ms,95%): 2.91 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 12 tps: 8016.29 qps: 8016.29 (r/w/o: 8016.29/0.00/0.00) lat (ms,95%): 2.97 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 12 tps: 8917.70 qps: 8917.70 (r/w/o: 8917.70/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 12 tps: 8867.84 qps: 8867.84 (r/w/o: 8867.84/0.00/0.00) lat (ms,95%): 2.48 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 12 tps: 9165.21 qps: 9165.21 (r/w/o: 9165.21/0.00/0.00) lat (ms,95%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 310s ] thds: 12 tps: 8957.08 qps: 8957.08 (r/w/o: 8957.08/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 12 tps: 8955.95 qps: 8956.05 (r/w/o: 8956.05/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 330s ] thds: 12 tps: 9160.20 qps: 9160.10 (r/w/o: 9160.10/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 12 tps: 8986.60 qps: 8986.60 (r/w/o: 8986.60/0.00/0.00) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 350s ] thds: 12 tps: 9267.06 qps: 9267.06 (r/w/o: 9267.06/0.00/0.00) lat (ms,95%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 12 tps: 9043.87 qps: 9043.87 (r/w/o: 9043.87/0.00/0.00) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 370s ] thds: 12 tps: 9183.12 qps: 9183.12 (r/w/o: 9183.12/0.00/0.00) lat (ms,95%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 380s ] thds: 12 tps: 9023.45 qps: 9023.45 (r/w/o: 9023.45/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 390s ] thds: 12 tps: 8622.06 qps: 8622.06 (r/w/o: 8622.06/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 400s ] thds: 12 tps: 8837.01 qps: 8837.01 (r/w/o: 8837.01/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 410s ] thds: 12 tps: 8786.98 qps: 8786.98 (r/w/o: 8786.98/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 420s ] thds: 12 tps: 8362.77 qps: 8362.77 (r/w/o: 8362.77/0.00/0.00) lat (ms,95%): 2.81 err/s: 0.00 reconn/s: 0.00
[ 430s ] thds: 12 tps: 8186.51 qps: 8186.51 (r/w/o: 8186.51/0.00/0.00) lat (ms,95%): 2.81 err/s: 0.00 reconn/s: 0.00
[ 440s ] thds: 12 tps: 9017.76 qps: 9017.76 (r/w/o: 9017.76/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 450s ] thds: 12 tps: 8946.12 qps: 8946.12 (r/w/o: 8946.12/0.00/0.00) lat (ms,95%): 2.48 err/s: 0.00 reconn/s: 0.00
[ 460s ] thds: 12 tps: 9087.77 qps: 9087.77 (r/w/o: 9087.77/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 470s ] thds: 12 tps: 8908.42 qps: 8908.42 (r/w/o: 8908.42/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 480s ] thds: 12 tps: 9123.96 qps: 9123.96 (r/w/o: 9123.96/0.00/0.00) lat (ms,95%): 2.39 err/s: 0.00 reconn/s: 0.00
[ 490s ] thds: 12 tps: 9196.95 qps: 9196.95 (r/w/o: 9196.95/0.00/0.00) lat (ms,95%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 500s ] thds: 12 tps: 9048.27 qps: 9048.27 (r/w/o: 9048.27/0.00/0.00) lat (ms,95%): 2.48 err/s: 0.00 reconn/s: 0.00
[ 510s ] thds: 12 tps: 8878.50 qps: 8878.50 (r/w/o: 8878.50/0.00/0.00) lat (ms,95%): 2.57 err/s: 0.00 reconn/s: 0.00
[ 520s ] thds: 12 tps: 9037.28 qps: 9037.28 (r/w/o: 9037.28/0.00/0.00) lat (ms,95%): 2.48 err/s: 0.00 reconn/s: 0.00
[ 530s ] thds: 12 tps: 8993.07 qps: 8993.07 (r/w/o: 8993.07/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
[ 540s ] thds: 12 tps: 8962.50 qps: 8962.50 (r/w/o: 8962.50/0.00/0.00) lat (ms,95%): 2.48 err/s: 0.00 reconn/s: 0.00
[ 550s ] thds: 12 tps: 8620.34 qps: 8620.34 (r/w/o: 8620.34/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 560s ] thds: 12 tps: 8464.40 qps: 8464.40 (r/w/o: 8464.40/0.00/0.00) lat (ms,95%): 2.76 err/s: 0.00 reconn/s: 0.00
[ 570s ] thds: 12 tps: 8171.28 qps: 8171.28 (r/w/o: 8171.28/0.00/0.00) lat (ms,95%): 2.91 err/s: 0.00 reconn/s: 0.00
[ 580s ] thds: 12 tps: 8421.99 qps: 8421.99 (r/w/o: 8421.99/0.00/0.00) lat (ms,95%): 2.76 err/s: 0.00 reconn/s: 0.00
[ 590s ] thds: 12 tps: 8913.25 qps: 8913.25 (r/w/o: 8913.25/0.00/0.00) lat (ms,95%): 2.52 err/s: 0.00 reconn/s: 0.00
[ 600s ] thds: 12 tps: 8920.02 qps: 8920.02 (r/w/o: 8920.02/0.00/0.00) lat (ms,95%): 2.43 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            5238526
        write:                           0
        other:                           0
        total:                           5238526
    transactions:                        5238526 (8730.74 per sec.)
    queries:                             5238526 (8730.74 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0057s
    total number of events:              5238526

Latency (ms):
         min:                                    0.65
         avg:                                    1.37
         max:                                  218.41
         95th percentile:                        2.57
         sum:                              7189000.63

Threads fairness:
    events (avg/stddev):           436543.8333/490.33
    execution time (avg/stddev):   599.0834/0.02